CREATE TABLE COURSE(
	c_name VARCHAR(30),
	c_id VARCHAR(30),
	p_id VARCHAR(30),
	c_id_no VARCHAR(30), 
	c_day VARCHAR(30),
	c_time VARCHAR(30),
	c_where VARCHAR(30),
	c_unit VARCHAR(30),
	c_max VARCHAR(30),
	PRIMARY KEY(c_id, c_id_no),
	FOREIGN KEY(p_id) REFERENCES professor(p_id)
);
insert into course values('데이터베이스 프로그래밍','1300','12001','1','월요일','12:00-14:50','명신관 408호','3', '30');
insert into course values('데이터베이스 프로그래밍','1300','12003','2','월요일, 수요일','15:00-16:45','명신관 409호','3', '30');
insert into course values('데이터사이언스 개론','1301','12000','1','화요일, 목요일','10:30-11:45','프라임관 203호','3', '70');
insert into course values('데이터마이닝 및 분석','1302','12000','1','화요일, 목요일','15:00-16:15','프라임관 203호','3', '70');
insert into course values('프로그래밍 언어론','1303','12013','1','화요일, 목요일','10:30-11:45','명관 415호','3', '30');
insert into course values('프로그래밍 언어론','1303','12009','2','화요일, 목요일','15:00-16:15','명관 415호','3', '30');
insert into course values('컴퓨터 구조','1304','12005','1','월요일, 수요일','15:00-16:45','명신관 423호','3', '20');
insert into course values('운영체제','1305','12010','1','월요일, 수요일','15:00-16:15','명신관 413호','3', '20');
insert into course values('운영체제','1305','12010','2','화요일, 목요일','10:30-11:45','명신관 413호','3', '20');
insert into course values('윈도우 프로그래밍','1306','12002','1','월요일, 수요일','10:00-11:50','명신관 413호','3', '20');
insert into course values('자료구조','1307','12006','1','화요일, 목요일','10:30-11:45','명신관 414호','3', '20');
insert into course values('컴퓨터 과학의 이해','1308','12004','1','월요일, 수요일','10:30-11:45','명신관 309호','3', '20');
insert into course values('프로그래밍 개론','1309','12004','1','월요일, 수요일','10:30-11:45','명신관 309호','3', '20');
insert into course values('데이터베이스 설계와 질의','1310','12001','1','화요일, 목요일','12:00-14:50','명신관 420호','3', '30');
insert into course values('데이터베이스 설계와 질의','1310','12001','2','화요일, 목요일','15:00-16:45','명신관 420호','3', '30');
insert into course values('시스템 프로그래밍','1311','12003','1','화요일, 목요일','09:00-10:15','명신관 309호','3', '40');
insert into course values('컴파일러','1312','12004','1','화요일, 목요일','15:00-16:15','명신관 203호','3', '20');
insert into course values('리눅스','1313','12013','1','화요일, 목요일','10:30-11:45','명관 421호','3', '30');
insert into course values('리눅스','1313','12009','2','화요일, 목요일','15:00-16:15','명관 421호','3', '30');
insert into course values('네트워크','1314','12011','1','월요일, 수요일','15:00-16:45','명신관 420호','3', '40');
insert into course values('컴퓨터 수학','1315','12008','1','월요일, 수요일','15:00-16:15','명신관 315호','3', '20');
insert into course values('데이터 사이언스 개론','1301','12008','2','화요일, 목요일','10:30-11:45','프라임관 303호','3', '50');
insert into course values('인공지능','1316','12007','1','월요일, 수요일','10:00-11:50','명신관 213호','3', '20');
insert into course values('소프트웨어의 이해','1317','12008','1','화요일, 목요일','10:30-11:45','명신관 414호','3', '20');
insert into course values('네트워크 보안','1318','12004','1','월요일, 수요일','10:30-11:45','명신관 309호','3', '20');
insert into course values('프로그래밍 언어론','1303','12013','3','월요일, 수요일','16:30-17:45','명신관 309호','3', '20');